build/classes/updatetradeup/wsdl-exemplo-update-xml-mcafee.xml

<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP:Header/>
    <SOAP:Body>
        <m:NSorder xmlns:m="urn:soapserver/soap:AuthorizationModule">
            <HEADER>
                <RPARTNERID>NETBR55</RPARTNERID>
            </HEADER>
            <DATA>
                <CUSTOMER>
                    <RCUSTOMERID>ois57218503015</RCUSTOMERID>
                    <RREQUESTTYPE>UPDATE</RREQUESTTYPE>
                    <REMAIL>ois57218503015@oi.com.br</REMAIL>
                    <RFIRSTNAME>MARIA</RFIRSTNAME>
                    <RLASTNAME>HELENA OLIVEIRA DE OLIVEIRA</RLASTNAME>
                    <RPASSWORD>eN7zI7dY9w</RPASSWORD>
                    <RLANGUAGE>pt-br</RLANGUAGE>
                </CUSTOMER>
                <ORDER>
                    <RNETSAFEREF>NETBR55_141231175310_OIS57218503015</RNETSAFEREF>
                    <RPARTNERREF>OI3661432837701005</RPARTNERREF>
                    <ITEM>
                        <RSKU SKU="907-61081-1usermds" QTY="2"/>
                    </ITEM>
                </ORDER>
            </DATA>
        </m:NSorder>
    </SOAP:Body>
</SOAP:Envelope> 